platforms/android/assets/www/templates/xml/worklocations.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <SecuredWebServiceHeader xmlns="http://vipersoftware.nl/">
      <AuthenticatedToken><%=token %></AuthenticatedToken>
    </SecuredWebServiceHeader>
  </soap:Header>
  <soap:Body>
    <GetWorkLocations xmlns="http://vipersoftware.nl/">
      <geoLatitude><%= latitude %></geoLatitude>
      <geoLongitude><%= longitude %></geoLongitude>
      <sector><%= sector %></sector>
         <radius><%= radius %></radius>  
    </GetWorkLocations>
  </soap:Body>
</soap:Envelope>